{
  "articles": [
    {
      "id": 1,
      "title": "OBFS4: The freedom protocol.",
      "author": "Libalpm",
      "date": "September 28, 2024",
      "bannerImage": "https://wallpaperaccess.com/full/1101225.jpg",
      "content": [
        {
          "type": "h2",
          "content": "OBFS4 proxy"
        },
        {
          "type": "p",
          "content": "Obfs4 disguises your internet traffic. It's built on the obfsproxy framework and works with the Tor network. Obfs4 masks your traffic to look legit. This means Deep Packet Inspection (DPI) systems can't easily detect that you're using a VPN as it disguises itself as legit web traffic."
        },
        {
          "type": "h2",
          "content": "Why should you care?"
        },
        {
          "type": "p",
          "content": "It's useful if you're in a place where Tor or VPNs are blocked (China, Iran). By wrapping Tor traffic, you're making it much harder for anyone to figure out what you're connecting to on the network."
        },
        {
          "type": "h2",
          "content": "Setting up obfs4"
        },
        {
          "type": "p",
          "content": "Setting up the bridge server:"
        },
        {
          "type": "p",
          "content": "First, clone the repo:"
        },
        {
          "type": "code",
          "content": "git clone https://gitlab.com/yawning/obfs4.git"
        },
        {
          "type": "p",
          "content": "Build it:"
        },
        {
          "type": "code",
          "content": "go build -o obfs4proxy/obfs4proxy ./obfs4proxy"
        },
        {
          "type": "p",
          "content": "Set it as a command:"
        },
        {
          "type": "code",
          "content": "ClientTransportPlugin obfs4 exec /usr/local/bin/obfs4proxy"
        },
        {
          "type": "p",
          "content": "Now, let's configure the bridge. Add these lines to your Tor configuration:"
        },
        {
          "type": "code",
          "content": "# Act as a bridge relay.\nBridgeRelay 1\n# Enable the Extended ORPort\nExtORPort auto\n# Use obfs4proxy to provide the obfs4 protocol.\nServerTransportPlugin obfs4 exec /usr/local/bin/obfs4proxy"
        },
        {
          "type": "p",
          "content": "If you want to specify a port for obfs4 connections, uncomment and edit this line:"
        },
        {
          "type": "code",
          "content": "#ServerTransportListenAddr obfs4 0.0.0.0:443"
        },
        {
          "type": "p",
          "content": "A quick note, you'll need to tweak your client config. Add these lines:"
        },
        {
          "type": "code",
          "content": "socks-proxy 127.0.0.1 443\nsocks-proxy-retry"
        },
        {
          "type": "p",
          "content": "And modify your remote line to:"
        },
        {
          "type": "code",
          "content": "remote <YOUR-VPN-SERVER> 443"
        },
        {
          "type": "p",
          "content": "Don't forget to restart both OpenVPN and obfsproxy after making these changes."
        },
        {
          "type": "h2",
          "content": "Conclusion"
        },
        {
          "type": "p",
          "content": "And there you have it! You're now running obfs4 and giving those DPI systems a run for their money."
        },
        {
          "type": "p",
          "content": "Stay safe out there, and happy browsing!"
        },
        {
          "type": "p",
          "content": "P.S. Check out the official repo in case anything changes: https://gitlab.com/yawning/obfs4"
        }
      ]
    },
    {
      "id": 2,
      "title": "CCNA3 NAT: Network Address Translation",
      "author": "Libalpm",
      "date": "September 29, 2024",
      "bannerImage": "assets/nat-issue-modern-warfare-2.jpg",
      "content": [
        {
          "type": "p",
          "content": "Can't play Modern Warfare 2? Better off anyway. (I'm kidding it's because I found it funny strict NAT's won't let you play MW2) Well while you're here learn about NAT. (I'm really not funny...)"
        },
        {
          "type": "h2",
          "content": "NAT CCNA3:"
        },
        {
          "type": "p",
          "content": "There are not enough IPv4 addresses to assign a unique address to each device connected to the internet. (This is obvious as defined in RFC 1918)"
        },
        {
          "type": "p",
          "content": "NAT's primary use is to conserve public IPv4 addresses. It does this by using private IPv4 addresses internally and providing translations when necessary."
        },
        {
          "type": "p",
          "content": "It can be a shield for privacy and security to a network. (Comment: NAT prevents port forwarding and uses a shared pool so basically multiple are sharing the same IPv4 address meaning it's a lot harder for a company to track you based on your IPv4)"
        },
        {
          "type": "p",
          "content": "NAT Enabled routers can be configured with one or more valid IPv4 Addresses and are contained into something called a NAT pool."
        },
        {
          "type": "p",
          "content": "A NAT router in most cases operates at the border of a stub network. A stub network is one or more networks with a single connection to its neighboring network. (You can actually see this in real life look on BGP tools for the tag Stub_AS short for Stub network ASN)"
        },
        {
          "type": "h2",
          "content": "How NAT works:"
        },
        {
          "type": "p",
          "content": "private IP (Inside Local) -> Your gateway router (Inside Global) -> The next hop router (Outside local) -> Destination ex. Server (Outside Global)"
        },
        {
          "type": "h2",
          "content": "NAT Terminology:"
        },
        {
          "type": "ul",
          "content": [
            "Inside address - The address of the device which is being translated by NAT.",
            "Outside address - The address of the destination device.",
            "Local address - A local address is any address that appears on the inside portion of the network.",
            "Global address - A global address is any address that appears on the outside portion of the network."
          ]
        },
        {
          "type": "h2",
          "content": "Types of NAT"
        },
        {
          "type": "h3",
          "content": "Static NAT:"
        },
        {
          "type": "p",
          "content": "Static NAT uses a one-to-one mapping of local and global addresses. These mappings are configured by the network administrator and remain constant."
        },
        {
          "type": "h3",
          "content": "Dynamic NAT:"
        },
        {
          "type": "p",
          "content": "Dynamic NAT uses a pool of public addresses and assigns them on a first-come, first-served basis. When an inside device requests access to an outside network, dynamic NAT assigns an available public IPv4 address from the pool."
        },
        {
          "type": "h3",
          "content": "Port Address Translation (PAT):"
        },
        {
          "type": "p",
          "content": "Also known as NAT overload, maps multiple private IPv4 addresses to a single public IPv4 address or a few addresses. This allows several devices in the household to simultaneously access the internet. Used by ISPs. Multiple addresses can be mapped to one or to a few addresses in the setup; each port number is tracked to each assigned private address. It generates a TCP/UDP source port value or assigns a query ID for ICMP to identify the session."
        },
        {
          "type": "p",
          "content": "PAT does a best-effort setup to preserve the original source port. However, if used, PAT assigns the first available port number starting from: 0-511, 512-1023, 1024-65535. When it has run out of ports, it moves to the next address to allocate the original source port."
        },
        {
          "type": "h2",
          "content": "Differences between NAT and PAT:"
        },
        {
          "type": "h3",
          "content": "NAT:"
        },
        {
          "type": "ul",
          "content": [
            "One-to-one mapping between Inside Local and Inside Global addresses.",
            "Uses only IPv4 addresses in translation process.",
            "A unique Inside Global address is required for each inside host accessing the outside network."
          ]
        },
        {
          "type": "p",
          "content": "Example:"
        },
        {
          "type": "code",
          "content": "Inside Global Address    Inside Local Address\n209.165.200.226          192.168.10.10\n209.165.200.227          192.168.10.11\n209.165.200.228          192.168.10.12\n209.165.200.229          192.168.10.13"
        },
        {
          "type": "p",
          "content": "Comment: Basically only one internal address can be assigned to the default gateway (router)."
        },
        {
          "type": "h3",
          "content": "PAT:"
        },
        {
          "type": "ul",
          "content": [
            "One Inside Global address can be mapped to many Inside Local addresses.",
            "Uses IPv4 addresses and TCP or UDP source port numbers in translation process.",
            "A single unique Inside Global address can be shared by many inside hosts accessing the outside network."
          ]
        },
        {
          "type": "p",
          "content": "Example:"
        },
        {
          "type": "code",
          "content": "Inside Global Address    Inside Local Address\n209.165.200.226:2031     192.168.10.10:2031\n209.165.200.226:1506     192.168.10.11:1506\n209.165.200.226:1131     192.168.10.12:1131\n209.165.200.226:1718     192.168.10.13:1718"
        },
        {
          "type": "p",
          "content": "Comment: Allows for multiple private addresses to use the same exact default gateway by making use of their source ports. To be honest, using regular NAT is pointless; PAT on top."
        },
        {
          "type": "h2",
          "content": "NAT Advantages"
        },
        {
          "type": "ul",
          "content": [
            "Privatizes our intranets (Comment: Cisco had a weird way of saying it was like legally registered addressing scheme; basically we are taking our private IP addresses in the subnet can share the same IP. I don't know why they try to make it as complicated as possible)",
            "May increase the flexibility of connections to the public network. Multiple pools, backup pools, load-balancing. (Comment: Basically you get a better network because the ISP may include certain setups to decrease latency and multiple IP addresses in case one is being overused)",
            "Removes readdressing of all hosts on the existing network. (Comment: if your network didn't use private addresses you'd have to manually update all IP addresses on every device; NAT eliminates this by keeping all IP addresses consistent, they don't change)"
          ]
        },
        {
          "type": "h2",
          "content": "NAT Disadvantages"
        },
        {
          "type": "ul",
          "content": [
            "Real-time protocols such as VoIP. NAT increases forwarding delays with the packets headers take time, The router must look at all packets the checksum must be recalculated. (Comment: No really Cisco? A 5th grader could figure that out.)",
            "Many ISPs are having to assign customers a private IPv4 address instead of a public IPv4 address. Also known as CG-NAT (Carrier-Grade NAT)",
            "End-to-End addressing is lost; many protocols depend on End-to-End addressing. (Comment: For example, if you try to host a Web server or Minecraft server it ain't happening; use Cloudflare tunnels to fix this, it's free. I've seen a Minecraft server run on a Cloudflare tunnel; it's quite interesting the trick they used to make that work. I may make an article on how they did it)",
            "Makes troubleshooting challenging because it's harder to trace packets that go through multiple address translations.",
            "Complicates the use of tunneling protocols such as IPSec (It prevents creating like an IPSec tunnel (An IPSec Tunnel is basically a VPN as it encrypted L3 IP packets) that allows certain access to like a VLAN or a network services; NAT prevents that as you can't remote into a private/reserved IP address)"
          ]
        },
        {
          "type": "h2",
          "content": "Configuring NAT"
        },
        {
          "type": "h3",
          "content": "Static NAT Configuration"
        },
        {
          "type": "code",
          "content": "(config)# ip nat inside source static 192.168.10.254 209.165.201.5\n(config)# interface serial 0/1/0\n(config-if)# ip address 192.168.1.2 255.255.255.252\n(config-if)# ip nat inside\n(config)# interface serial 0/1/1\n(config-if)# ip address 209.165.200.1 255.255.255.252\n(config-if)# ip nat outside"
        },
        {
          "type": "p",
          "content": "Basically what is happening here is Serial0/1/0 is facing our local network and serial0/1/1 is facing the next hop router."
        },
        {
          "type": "h3",
          "content": "Dynamic NAT Configuration"
        },
        {
          "type": "code",
          "content": "(config)# ip nat pool NAT-POOL1 209.165.200.226 209.165.200.240 netmask 255.255.255.224\n(config)# access-list 1 permit 192.168.0.0 0.0.255.255\n(config)# ip nat inside source list 1 pool NAT-POOL1"
        },
        {
          "type": "p",
          "content": "Dynamic NAT is the same thing but we use POOLs instead pools contain multiple public IP addresses. In this case from the range .226-240."
        },
        {
          "type": "h3",
          "content": "PAT Configuration"
        },
        {
          "type": "code",
          "content": "(config)# ip nat pool NAT-POOL2 209.165.200.226 209.165.200.240 netmask 255.255.255.224\n(config)# access-list 1 permit 192.168.0.0 0.0.255.255\n(config)# ip nat inside source list 1 pool NAT-POOL2 overload\n(config)# interface serial0/1/0\n(config-if)# ip nat inside\n(config-if)# exit\n(config)# interface serial0/1/1\n(config-if)# ip nat outside\n(config-if)# end"
        },
        {
          "type": "p",
          "content": "We are now using a NAT Pool then we are applying an ACL to permit the local network (the 192.168.0.0/16 basically is whatever your DHCP server is handing out) and configuring the router and local network directions inside / outside."
        },
        {
          "type": "h2",
          "content": "NAT64: NAT for IPv6"
        },
        {
          "type": "p",
          "content": "NAT64 for IPv6 is actually used for providing access between IPv6-only and IPv4-only networks, fascinating right?"
        },
        {
          "type": "p",
          "content": "It uses IPv6's Dual Stack feature when devices are running protocols associated with IPv6 and IPv4. It basically encapsulates the IPv6 packet inside an IPv4 packet, allowing the IPv6 packet to be transmitted over an IPv4-only network."
        },
        {
          "type": "p",
          "content": "It only serves as a temporary mechanism to assist the migration from IPv4 to IPv6."
        }
      ]
    },
    {
      "id": 3,
      "title": "CCNA3: WANS",
      "author": "Libalpm",
      "date": "September 30, 2024",
      "bannerImage": "assets/WAN.jpg",
      "content": [
        {
          "type": "p",
          "content": "The modern WAN standards are defined by a number of authorities:"
        },
        {
          "type": "ul",
          "content": [
            "TIA/EIA - Telecommunications Industry Association and Electronic Industries Alliance",
            "ISO - International Organization for Standardization",
            "IEEE - Institute of Electrical and Electronics Engineers"
          ]
        },
        {
          "type": "p",
          "content": "WANs operate only at the Layer 1 and Layer 2 (Physical, Data-Link)."
        },
        {
          "type": "p",
          "content": "High Optical Fiber media to span long distances use the following Fiber protocol standards:"
        },
        {
          "type": "ul",
          "content": [
            "Synchronous Digital Hierarchy (SDH)",
            "Synchronous Optical Networking (SONET)",
            "Dense Wavelength Division Multiplexing (DWDM)"
          ]
        },
        {
          "type": "h2",
          "content": "L2 Protocols:"
        },
        {
          "type": "ul",
          "content": [
            "Broadband (i.e., DSL and Cable)",
            "Wireless",
            "Ethernet WAN (Metro Ethernet)",
            "Multiprotocol Label Switching (MPLS)",
            "Point-to-Point Protocol (PPP) (less used)",
            "High-Level Data Link Control (HDLC) (less used)",
            "Frame Relay (legacy)",
            "Asynchronous Transfer Mode (ATM) (legacy)"
          ]
        },
        {
          "type": "p",
          "content": "The WAN physical layer describes the physical connections between the company network and the service provider network."
        },
        {
          "type": "h2",
          "content": "Terminology:"
        },
        {
          "type": "h3",
          "content": "Data Terminal Equipment (DTE)"
        },
        {
          "type": "ul",
          "content": [
            "Connects subscriber LANs to WAN communication devices (DCE).",
            "Hosts send traffic to the DTE device.",
            "Typically a router, but can also be a host or server.",
            "Connects to the local loop through the DCE."
          ]
        },
        {
          "type": "h3",
          "content": "Data Communications Equipment (DCE)"
        },
        {
          "type": "ul",
          "content": [
            "Also known as data circuit-terminating equipment.",
            "Communicates with the service provider.",
            "Provides an interface for subscribers to connect to the WAN."
          ]
        },
        {
          "type": "h3",
          "content": "Customer Premises Equipment (CPE)"
        },
        {
          "type": "ul",
          "content": [
            "Includes DTE and DCE devices (router, modem, optical converter).",
            "Located at the enterprise edge.",
            "Can be owned or leased by the subscriber."
          ]
        },
        {
          "type": "h3",
          "content": "Point-of-Presence (POP)"
        },
        {
          "type": "ul",
          "content": [
            "The point where the subscriber connects to the service provider network."
          ]
        },
        {
          "type": "h3",
          "content": "Demarcation Point"
        },
        {
          "type": "ul",
          "content": [
            "Physical location separating CPE from service provider equipment.",
            "Typically a cabling junction box on customer premises.",
            "Identifies the boundary for network operation responsibilities."
          ]
        },
        {
          "type": "h3",
          "content": "Local Loop (or Last Mile)"
        },
        {
          "type": "ul",
          "content": [
            "The copper or fiber cable connecting CPE to the Central Office (CO) of the service provider."
          ]
        },
        {
          "type": "h3",
          "content": "Central Office (CO)"
        },
        {
          "type": "ul",
          "content": [
            "Local facility that connects CPE to the provider network."
          ]
        },
        {
          "type": "h3",
          "content": "Toll Network"
        },
        {
          "type": "ul",
          "content": [
            "Includes backhaul, long-haul, all-digital, fiber-optic communications, and related equipment within the WAN provider network."
          ]
        },
        {
          "type": "h3",
          "content": "Backhaul Network"
        },
        {
          "type": "ul",
          "content": [
            "Connects multiple access nodes of the service provider network.",
            "Can span municipalities, countries, and regions.",
            "Connected to internet service providers and the backbone network."
          ]
        },
        {
          "type": "h3",
          "content": "Backbone Network"
        },
        {
          "type": "ul",
          "content": [
            "Large, high-capacity networks interconnecting service provider networks.",
            "Creates a redundant network.",
            "Tier-1 providers can connect directly or through other service providers."
          ]
        },
        {
          "type": "h2",
          "content": "Types of WAN Devices:"
        },
        {
          "type": "ul",
          "content": [
            "Voiceband Modem - Also known as Dial-up internet, uses telephone lines to transmit data.",
            "DSL/Cable Modem - Known as broadband modems, high speed they connect to the data terminal equipment (DCE to connect to DTE). DSL connects via telephone lines, Cable connects via coaxial lines.",
            "CSU/DSU - Digital leased lines require CSU and DSU, it can be a modem or it can be an interface on a router, CSU provides termination for the digital signal and ensures connection integrity.",
            "Optical Converter - Optical Fiber, it connects copper media (Ethernet) and converts them to optical signals to electronic pulses.",
            "Wireless Router / AP - Wirelessly connects to a WAN provider, also uses cellular wireless connectivity.",
            "WAN Core Devices - The WAN backbone, consists of high-speed routers and layer 3 switches. Must be able to support the highest speeds in the WAN core. Must be able to forward packets at full speed. Also must support many protocols at the core."
          ]
        },
        {
          "type": "h2",
          "content": "Serial Communication:"
        },
        {
          "type": "p",
          "content": "Almost all network communications occur using a serial communication delivery. Serial transmits bits sequentially over a single channel. In contrast, parallel simultaneously transmits several bits over multiple wires. It is not viable to use parallel connections even though it's 8 times faster; it is prone to synchronization problems because the timing between channels becomes more sensitive to distance. If you were to use a copper cable, it is limited to 8 meters (26 feet)."
        },
        {
          "type": "p",
          "content": "Cisco Nexus switches support parallel optics to transfer more data signals to achieve high speed (i.e., 100, 200, 300, and even up to 400 Gbps per interface); these are only used in data center environments or large corporate networks and are expensive."
        },
        {
          "type": "h2",
          "content": "Circuit-Switched Communication:"
        },
        {
          "type": "p",
          "content": "A circuit-switched network establishes a dedicated circuit (or channel) between endpoints before the users can communicate. During transmission over a circuit-switched network, all communication uses the same path. The entire fixed capacity allocated to the circuit is available for the duration of the connection, regardless of whether there is information to transmit or not. This can lead to inefficiencies in circuit usage. For this reason, circuit switching is generally not suited for data communication. The most common types of circuit-switched technologies are the public switched telephone network (PSTN) and the legacy Integrated Services Digital Network (ISDN)."
        },
        {
          "type": "h2",
          "content": "Packet-Switched Communication:"
        },
        {
          "type": "p",
          "content": "Network communication is most commonly implemented using packet-switched communication. Packet-switched networks do not require a circuit to be established, and they allow many pairs of nodes to communicate over the same channel. Packet switching is much less expensive and more flexible than circuit switching. Although susceptible to delays (latency) and variability of delay (jitter), modern technology allows satisfactory transport of voice and video communications on these networks."
        },
        {
          "type": "p",
          "content": "Common types of packet-switched WAN technologies are Ethernet WAN (Metro Ethernet), MPLS (Multiprotocol Label Switching), as well as the legacy options Frame Relay and Asynchronous Transfer Mode (ATM)."
        },
        {
          "type": "h2",
          "content": "SDH, SONET, and DWDM:"
        },
        {
          "type": "ul",
          "content": [
            "Fiber > Copper (less attenuation (distance of travel), resistance to EMI / RFI, its transfer speed)",
            "SDH - Synchronous Digital Hierarchy (SDH) is a global standard for transporting data over fiber-optic cable.",
            "SONET - Synchronous Optical Networking (SONET) is the North American standard that provides the same services as SDH."
          ]
        },
        {
          "type": "p",
          "content": "Both standards are basically the same thing. SDH/SONET define how to transfer multiple data, voice, and video communications over optical fiber using lasers or light-emitting diodes (LEDs) over great distances."
        },
        {
          "type": "p",
          "content": "Dense Wavelength Division Multiplexing (DWDM) is a newer technology that increases the data-carrying capacity of SDH and SONET by simultaneously sending multiple streams of data (multiplexing) using different wavelengths of light. It basically takes one fiber cable and allows for multiple data streams to be transmitted simultaneously over a single fiber optical cable. It uses different wavelengths of light creating virtual channels."
        },
        {
          "type": "h2",
          "content": "Traditional WAN Connectivity Options:"
        },
        {
          "type": "ul",
          "content": [
            "Dedicated Options - Leased lines from T1 - E1 (up to 1.544 Mbps / 2.048 Mbps) and T3/E3 (up to 43.7 Mbps / 34.368 Mbps) connections."
          ]
        },
        {
          "type": "h3",
          "content": "Circuit Switched Connections:"
        },
        {
          "type": "ul",
          "content": [
            "PSTN: Dial-up access using voice modems, limited to under 56 kbps. Considered a legacy technology.",
            "ISDN: Offers digital signal transport with speeds from 45 Kbps to 2.048 Mbps."
          ]
        },
        {
          "type": "h3",
          "content": "Packet-Switched:"
        },
        {
          "type": "ul",
          "content": [
            "Frame Relay: Connects multiple sites through PVCs (up to 4 Mbps).",
            "ATM: Transfers voice, video, and data using fixed-length cells (53 bytes). Less efficient than Frame Relay."
          ]
        },
        {
          "type": "h2",
          "content": "Modern WANs:"
        },
        {
          "type": "h3",
          "content": "Dedicated Broadband"
        },
        {
          "type": "p",
          "content": "In the late 1990s, telecom companies built optical fiber networks anticipating future needs. Advances like wavelength division multiplexing (WDM) greatly increased a single fiber's capacity, leaving many fiber runs unused, referred to as \"dark fiber.\""
        },
        {
          "type": "h3",
          "content": "Packet-Switched"
        },
        {
          "type": "p",
          "content": "Two packet-switched WAN network options are available. Enabled it to expand into the MAN and WAN areas. Metro Ethernet provides fast bandwidth links. Multi-protocol Label Switching (MPLS) enables the WAN provider network to carry any protocol (e.g., IPv4 packets, IPv6 packets, Ethernet, DSL) as payload data. This enables different sites to connect to the provider network regardless of its access technologies."
        },
        {
          "type": "h3",
          "content": "Internet-based Broadband"
        },
        {
          "type": "p",
          "content": "Organizations are now commonly using the global internet infrastructure for WAN connectivity. To address the security concerns, the connectivity options are often combined with VPN technologies."
        },
        {
          "type": "h3",
          "content": "Ethernet WAN"
        },
        {
          "type": "p",
          "content": "Newer Ethernet standards using fiber-optic cables have made Ethernet a reasonable WAN access option. For example: the IEEE 1000BASE-LX standard supports fiber-optic cable lengths of 5 km, while the IEEE 1000BASE-ZX standard supports cable lengths up to 70 km. The Ethernet WAN service can go by many names, including the following:"
        },
        {
          "type": "ul",
          "content": [
            "Metropolitan Ethernet (Metro E)",
            "Ethernet over MPLS (EoMPLS)",
            "Virtual Private LAN Service (VPLS)"
          ]
        },
        {
          "type": "h2",
          "content": "MPLS:"
        },
        {
          "type": "p",
          "content": "Multiprotocol Label Switching (MPLS) is a high-performance service provider WAN routing technology to interconnect clients without regard to access method or payload. MPLS supports a variety of client access methods (e.g., Ethernet, DSL, Cable, Frame Relay). MPLS can encapsulate all types of protocols including IPv4 and IPv6 traffic. An MPLS router can be a customer edge (CE) router, a provider edge (PE) router, or an internal provider (P) router. Notice that MPLS supports a variety of client access connections. MPLS routers are label switched routers (LSRs). This means that they attach labels to packets that are then used by other MPLS routers to forward traffic. When traffic is leaving the CE, the MPLS PE router adds a short fixed-length label in between the frame header and packet header. MPLS P routers use the label to determine the next hop of the packet. The label is removed by the egress PE router when the packet leaves the MPLS network."
        },
        {
          "type": "h2",
          "content": "Internet-Based Connectivity Options"
        },
        {
          "type": "p",
          "content": "Modern WAN options extend beyond Ethernet WAN and MPLS to include various internet-based wired and wireless connectivity solutions."
        },
        {
          "type": "h3",
          "content": "Types:"
        },
        {
          "type": "ul",
          "content": [
            "Wired: xDSL, cable, optical fiber",
            "Wireless: municipal Wi-Fi, cellular, satellite internet, WiMAX"
          ]
        },
        {
          "type": "h2",
          "content": "DSL Technology"
        },
        {
          "type": "p",
          "content": "Digital Subscriber Line (DSL) uses existing twisted-pair telephone lines for high-speed, always-on IP services."
        },
        {
          "type": "h3",
          "content": "Types:"
        },
        {
          "type": "ul",
          "content": [
            "ADSL (Asymmetric DSL): Higher downstream than upstream bandwidth.",
            "SDSL (Symmetric DSL): Equal upload and download capacity."
          ]
        },
        {
          "type": "h3",
          "content": "Factors Affecting Performance:"
        },
        {
          "type": "p",
          "content": "Distance from the provider, type, and condition of cabling."
        },
        {
          "type": "h3",
          "content": "DSL Connections"
        },
        {
          "type": "p",
          "content": "DSL connections are established between the DSL modem and the DSL access multiplexer (DSLAM). The DSL modem converts Ethernet signals to DSL signals for transmission to the DSLAM, which concentrates connections from multiple users."
        },
        {
          "type": "h3",
          "content": "DSL and PPP"
        },
        {
          "type": "p",
          "content": "Point-to-Point Protocol (PPP): A Layer 2 protocol used by ISPs for DSL connections for authentication, IP address assignment, and link-quality management."
        },
        {
          "type": "p",
          "content": "Deployment: PPP over Ethernet (PPPoE) can be set up directly on a host or a router."
        },
        {
          "type": "h2",
          "content": "Cable Technology"
        },
        {
          "type": "p",
          "content": "Uses coaxial cable to provide high-speed, always-on internet access. DOCSIS: The standard for adding high-bandwidth data to cable systems. Network Setup: Cable systems use hybrid fiber-coaxial (HFC) networks with both coaxial and fiber-optic cables."
        },
        {
          "type": "h2",
          "content": "Optical Fiber"
        },
        {
          "type": "h3",
          "content": "Types:"
        },
        {
          "type": "ul",
          "content": [
            "Fiber to the Home (FTTH)",
            "Fiber to the Building (FTTB)",
            "Fiber to the Node/Neighborhood (FTTN)"
          ]
        },
        {
          "type": "h3",
          "content": "Advantage:"
        },
        {
          "type": "p",
          "content": "Delivers the highest bandwidth among broadband options."
        },
        {
          "type": "h2",
          "content": "Wireless Internet-Based Broadband"
        },
        {
          "type": "p",
          "content": "Uses unlicensed radio spectrum; less expensive but affected by distance, interference, and user load. Municipal Wi-Fi: Cities set up wireless networks for public access or city use."
        },
        {
          "type": "h2",
          "content": "VPN Technology"
        },
        {
          "type": "p",
          "content": "Provides secure, encrypted connections over public networks."
        },
        {
          "type": "h3",
          "content": "Benefits:"
        },
        {
          "type": "p",
          "content": "Cost savings, high security, scalability, and compatibility with broadband."
        },
        {
          "type": "h3",
          "content": "Types:"
        },
        {
          "type": "ul",
          "content": [
            "Site-to-site: Transparent to users, configured on routers.",
            "Remote Access: Users initiate the connection."
          ]
        },
        {
          "type": "h2",
          "content": "ISP Connectivity Options"
        },
        {
          "type": "h3",
          "content": "Types:"
        },
        {
          "type": "ul",
          "content": [
            "Single-homed: One ISP connection, no redundancy, least expensive.",
            "Dual-homed: Two connections for redundancy.",
            "Multihomed: Multiple connections to different ISPs for reliability.",
            "Dual-multihomed: A combination for enhanced resilience."
          ]
        },
        {
          "type": "h2",
          "content": "Broadband Solution Comparison"
        },
        {
          "type": "h3",
          "content": "Considerations:"
        },
        {
          "type": "ul",
          "content": [
            "Cable: Shared bandwidth, slower upload during peak times.",
            "DSL: Limited, distance-sensitive bandwidth with lower upload rates.",
            "Fiber-to-the-Home: Direct fiber installation; ideal but may not be available everywhere.",
            "Cellular/Mobile: Coverage issues, limited bandwidth.",
            "Municipal Wi-Fi: Viable if available; not commonly deployed as mesh networks.",
            "Satellite: High cost, limited capacity, typically a last resort."
          ]
        }
      ]
    },
    {
      "id": 4,
      "title": "DPDK (Data Plane Development Kit) vs. XDP (exPRESS Data Path)",
      "author": "Libalpm",
      "date": "September 30, 2024",
      "bannerImage": "assets/XDP-DPDK.jpg",
      "content": [
        {
          "type": "h2",
          "content": "XDP (exPRESS Data Path)"
        },
        {
          "type": "p",
          "content": "XDP is an eBPF (extended Berkeley Packet Filter)-based high-performance data path used to send and receive network packets at high rates by bypassing most of the operating system's networking stack. It does this by being directly implemented in the Linux, Windows, and BSD kernels."
        },
        {
          "type": "p",
          "content": "XDP uses early hooks in the RX path of the kernel to let the XDP program compiled and assigned to an interface decide the fate of the packet. It does this before any memory allocation needs to be made by the network stack itself. XDP can drop ~27-35 million PPS with basic hardware."
        },
        {
          "type": "p",
          "content": "Before you can assign an eBPF program, it checks that the program contains no out-of-bounds accesses (out of the scope of the operating system), loops, or global variables."
        },
        {
          "type": "p",
          "content": "Here are the options you can specify in the eBPF program:"
        },
        {
          "type": "ul",
          "content": [
            "XDP_PASS: let the packet continue through the network stack.",
            "XDP_DROP: silently drop the packet.",
            "XDP_ABORTED: drop the packet with trace point exception.",
            "XDP_TX: bounce the packet back to the same NIC it arrived on.",
            "XDP_REDIRECT: redirect the packet to another NIC or user space socket via the AF_XDP address family."
          ]
        },
        {
          "type": "p",
          "content": "The eBPF program is loaded on the XDP stack and tells it the instructions if the type of packet is matched."
        },
        {
          "type": "p",
          "content": "It can be especially useful for high-performance observability tools, load balancers, firewalls, and DDoS protection. Perhaps most importantly, it’s fairly easy to create and load an XDP program with the help of existing libraries, such as the BCC framework [https://github.com/iovisor/bcc], as well as XDP’s rich toolset [https://github.com/xdp-project/xdp-tools]."
        },
        {
          "type": "p",
          "content": "Drawbacks of using XDP:"
        },
        {
          "type": "ul",
          "content": [
            "XDP is primarily supported on specific hardware and NICs.",
            "Performance Overhead: While an XDP program is designed for high performance, poor optimization ultimately leads to performance degradation.",
            "Lack of Standardization: You have to keep note of what kernel you're using; otherwise, you're going to have compatibility issues.",
            "Lack of foundation: By default, XDP is stateless; you will need additional use of eBPF maps to maintain the state packets are in."
          ]
        },
        {
          "type": "h2",
          "content": "DPDK (Data Plane Development Kit)"
        },
        {
          "type": "p",
          "content": "DPDK is an open-source project managed by the Linux Foundation. It provides data plane libraries and an NIC polling mode driver for offloading TCP packet processing from the operating system kernel to processes running in user space."
        },
        {
          "type": "p",
          "content": "So what's all the fuss?"
        },
        {
          "type": "p",
          "content": "DPDK bypasses the kernel and uses drivers (Polling Mode Drivers, or PMDs) that interact directly with the hardware, allowing direct hardware packet processing."
        },
        {
          "type": "p",
          "content": "It allows the speed to perhaps be however fast as your NIC, DPDK can handle more than 100 million PPS!"
        },
        {
          "type": "p",
          "content": "DPDK achieves very high PPS rates, making it the absolute best method for cost-efficient DDoS mitigation, firewalls, load balancing, etc."
        },
        {
          "type": "p",
          "content": "DPDK can process packets in real time and process the volume of incoming packets."
        },
        {
          "type": "p",
          "content": "DPDK can do real-time traffic shaping, analysis, and response to traffic patterns and can do heuristics, which makes it better than XDP programs."
        },
        {
          "type": "p",
          "content": "DPDK by default can facilitate DPI (deep packet inspection) to analyze the content of packets and identify patterns inside the packet; it reads not only the headers but also the data fields."
        },
        {
          "type": "p",
          "content": "Drawbacks of using DPDK:"
        },
        {
          "type": "ul",
          "content": [
            "DPDK requires expert-level knowledge of hardware and networking. Developers need to manually manage memory, CPU affinity, and thread management.",
            "DPDK cannot be run on VPS's (Virtual Private Servers); it has to be run on dedicated CPU cores and memory; there is no virtualization allowed.",
            "DPDK doesn't support certain protocols.",
            "Vendor-specific Optimizations: DPDK's performance all depends on whoever your hardware manufacturer is and how good they are at coding NICs."
          ]
        }
      ]
    }    
  ]
}
